app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY `posts`.`id` DESC
---
  def index
    @posts = Post.all.order(id: "DESC")

INSERT INTO `posts` (`content`, `created_at`, `updated_at`) VALUES ('', '2022-12-06 08:18:08.215924', '2022-12-06 08:18:08.215924')
---
  def create
    post = Post.create(content: params[:content])